run/icoMultiPhaseChangeVoF/testDiffusion/0/alpha.oil.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alpha.water;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [];

internalField   uniform 0;

boundaryField
{
    "(right|left|bottom)"
    {
        type            alphaContactAngle;
        contactAngleProperties
        {
            air             { theta0 90; }
            oil             { theta0 90; }
        }
        value           uniform 0;
    }

    top
    {
        type            inletOutlet;
        inletValue      uniform 0;
        value           uniform 0;
    }

    "(front|back)"
    {
        type            empty;
    }
}


// ************************************************************************* //